# Curso Pandas - Exercícios

## Informações de um DataFrame

In [2]:
import pandas as pd
data = [['Fulano',12,7.0,True], ['Sicrano',15,3.5,False],['Beltrano',18,9.3,True]]
dados = pd.DataFrame(data, columns = ['Nome','Idade','Nota','Situação'])
dados

       Nome  Idade  Nota  Situação
0    Fulano     12   7.0      True
1   Sicrano     15   3.5     False
2  Beltrano     18   9.3      True

In [15]:
dados.dtypes
tipos_de_dados = pd.DataFrame(dados.dtypes, columns = ['Tipos de Dados'])

In [17]:
tipos_de_dados.columns.name = 'Variáveis'

In [18]:
tipos_de_dados

Variáveis Tipos de Dados
Nome              object
Idade              int64
Nota             float64
Situação            bool

In [20]:
print(f'A base de dados possui {dados.shape[0]} registros (alunos) e {dados.shape[1]} variáveis (nota,nome..)')

A base de dados possui 3 registros (alunos) e 4 variáveis (nota,nome..)

## Criação de um DataFrame

In [3]:
import pandas as pd
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})

pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [7]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [21]:

dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')

columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [15]:
help(.split())

SyntaxError: invalid syntax (2871150536.py, line 1)